001_Конспекты_2/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.Темы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лекция</name>
    <type>
      <types>CatalogRef.Лекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЗаметкиФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <attributes>
      <name>Текстовка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВидыПримечаний</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_2/src/Catalogs/Заметки/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьКоличествоСтрокПолей() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
	КонецЕсли;
	
	Объект.ОсновнойТекст = СформироватьОсновнойТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура;
 	Структура.Вставить("ТекстДобавления", ВыбранноеЗначение.ВведенныйТекст);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	Структура.Вставить("Тэг"			, ВыбранноеЗначение.Тэг);
 	
 	ДобавитьСтрокуHTML(Структура); 
	
	Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();	
	
	Модифицированность 		= Истина;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РедактироватьПриИзменении(Элемент)
	Если Редактировать = Истина Тогда		
		Элементы.ГруппаОсновнойтекст.Видимость = Ложь;
		Элементы.ГруппаСтруткура.Показать();
	Иначе
		Элементы.ГруппаОсновнойтекст.Видимость = Истина;;
		Элементы.ГруппаСтруткура.Скрыть();		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоля

&НаКлиенте
Процедура ПоляПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Поля.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.Тэг) Тогда
		ТекстВставки = СформироватьТекстДляВставки(Элементы.Поля.ТекущаяСтрока+1);
	Иначе
		ТекстВставки = "Нет редактируется";		
	КонецЕсли;
	
	ТекстСтроки =  ВставкиДляСтрокиТекста(ТекстВставки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВвестиТекст(Команда)
	СтрутураПараметров = Новый Структура;	
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаРедактирования", СтрутураПараметров, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЖирный(Команда)
    Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки","b", Ложь, Ложь, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаКурсив(Команда)
	Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки","i", Ложь, Ложь, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодчеркнутый(Команда) 
	Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки","u", Ложь, Ложь, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗачеркнутый(Команда)
	Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки","s", Ложь, Ложь, Ложь);
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗнакМеньше(Команда) 
	Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки","&lt; ", Истина, Истина, "Перед");
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗнакБольше(Команда)
	Структура = Новый Структура("Символ, Одиночный, Спесимвол, МестоВставки"," &gt;", Истина, Истина, "После");
	ИзменитьВыделенное(Структура);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
Процедура ИзменитьВыделенное(Структура)
	Док				= Элементы.ОсновнойТекст.document;
	Выделение		= Док.getSelection();
	
	Если Не Выделение.focusNode = Неопределено Тогда  
		ВыделенныйТекст = Выделение.focusNode.textContent;
		НомерСтроки 	= Выделение.focusNode.parentElement.id;
		Если Не НомерСтроки = "" Тогда
			elem 			= Док.getElementById(НомерСтроки);
			НужнаяСтрока 	= Объект.Поля.Получить(НомерСтроки - 1);
			тестСтроки      = НужнаяСтрока.Значение; 
			
			а = НайтиСпецСимвол(ВыделенныйТекст);
			 
			 Если  Структура.Спесимвол Тогда 
				Если Структура.МестоВставки = "Перед" Тогда
					текстДляЗамены  = Структура.Символ + ВыделенныйТекст;						
				Иначе 
					текстДляЗамены  = ВыделенныйТекст + Структура.Символ;	
				КонецЕсли;	
			Иначе 	
				Если Структура.Одиночный Тогда
					текстДляЗамены  = ВыделенныйТекст + "<" + Структура.Символ + ">";
				Иначе
					текстДляЗамены  = "<" + Структура.Символ + ">" + ВыделенныйТекст + "</" + Структура.Символ + ">";
				КонецЕсли;
			КонецЕсли;
			
			тестСтроки 		= СтрЗаменить(тестСтроки, ВыделенныйТекст,текстДляЗамены);    
			
			НужнаяСтрока.Значение 	= тестСтроки;  			
			Модифицированность 		= Истина;			
			Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();   
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция НайтиСпецСимвол(текСтрока)
	СпецСимвол = Неопределено;
	Если СпецСимвол = "<" Тогда 
		СпецСимволНайден = "&lt;"	
	ИначеЕсли СпецСимвол = ">"  Тогда 
		СпецСимволНайден = "&gt;" 			
	КонецЕсли;
	
	Возврат  СпецСимволНайден;
КонецФункции	

// Получить номер строки для вставки.
// Ищет номер строки перед закрытие секции body
// 
// Возвращаемое значение:
//  Число - Получить номер строки для вставки
&НаСервере
Функция ПолучитьНомерСтрокиДляВставки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("Значение", "</body>");
	 
	ПоискБоди = Объект.Поля.НайтиСтроки(Отбор);
	
	Если ПоискБоди = Неопределено Тогда
		НомерСтроки = ПолучитьКоличествоСтрокПолей();
	Иначе
		НомерСтроки = ПоискБоди[0].НомерСтроки	
	КонецЕсли;			
	
	Возврат НомерСтроки;
	
КонецФункции

// Получить количество строк полей.
// 
// Возвращаемое значение:
//  Число - Получить количество строк полей
&НаСервере
Функция ПолучитьКоличествоСтрокПолей()
	Возврат Объект.Поля.Количество();
КонецФункции

 // Добавить начальную страницу HTML.
 //Формируют пустую струткура Основного текста - HTML документа
 &НаСервере
 Процедура ДобавитьНачальнуюСтраницуHTML()
 	Структура = Новый Структура;
 	
 	Структура.Вставить("Вставка", Ложь); 
 	Структура.Вставить("НомерСтроки"	, 0);
  	Структура.Вставить("Тэг"			, Неопределено);
	
 	Структура.Вставить("ТекстДобавления", "<!DOCTYPE html>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<html lang=""ru"">");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	ТекстДобавления = ДобавитьHead();
 		
 	Структура.Вставить("ТекстДобавления", ТекстДобавления);
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</html>");
 	ДобавитьСтрокуHTML(Структура); 
 
 КонецПроцедуры
 
  // Добавить head.
  //Добавляет секцию head
  // 
  // Возвращаемое значение:
  //  Строка - секция head
  &НаСервере
 Функция ДобавитьHead()
 	ТекстКоментария = "";
 	ТекстКоментария = ТекстКоментария + "<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<meta charset=""UTF-8""" + ">";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</head>";
 	
 	Возврат ТекстКоментария; 
 КонецФункции
 
  // Добавить строку HTML.
  // Новая строка в ТЧ 
  //
  // Параметры:
  //  Структура - Структура - Структура:
  // * Вставка - Булево - 
  // * НомерСтроки - Число - 
  // * Тэг - Неопределено - 
  // * ТекстДобавления - Строка - 
  &НаСервере
 Процедура ДобавитьСтрокуHTML(Структура)
 	Если Структура.Вставка Тогда
 		НоваяСтрока = Объект.Поля.Вставить(Структура.НомерСтроки)
 	Иначе	
 		НоваяСтрока = Объект.Поля.Добавить();	
 	КонецЕсли;
 	
 	НоваяСтрока.Значение = Структура.ТекстДобавления; 
	Если Не Структура.Тэг = Неопределено Тогда  
 		НоваяСтрока.Тэг      = Структура.Тэг;
	КонецЕсли;
	
 КонецПроцедуры
 
  // Сформировать основной текст.
  // ФОрмирует страницу html
  //
  // Возвращаемое значение:
  //  Строка - Станица html
  &НаСервере
Функция СформироватьОсновнойТекст()
	
	ОсновнойТекст = "";
	
	Для Каждого СтрокаТЧ Из Объект.Поля Цикл
			ТекстДляВставки = СформироватьТекстДляВставки(СтрокаТЧ.НомерСтроки);
			ОсновнойТекст = ОсновнойТекст + ТекстДляВставки;
	КонецЦикла;
	 
	Возврат ОсновнойТекст;
	
КонецФункции

// Сформировать текст для вставки.
// Для строки по номеру, преобразует текс в формат html
// 
// Параметры:
//  НомерСтроки - Число - Номер строки
// 
// Возвращаемое значение:
//  Строка - Сформировать текст для вставки
&НаСервере
Функция СформироватьТекстДляВставки(НомерСтроки)
	СтрокаТЧ = объект.Поля.Получить(НомерСтроки-1);
	ТекстДляВставки = "";
	Если ЗначениеЗаполнено(СтрокаТЧ.Тэг) Тогда
			текТэг 			= СтрокаТЧ.Тэг;
			ОдиночныйТэг 	= текТэг.Одиночный;
			
			Структура = Новый Структура();
			Структура.Вставить("Одиночный", 	ОдиночныйТэг);
			Структура.Вставить("Наименование", 	текТэг.Наименование);
			Структура.Вставить("Значение", 		СтрокаТЧ.Значение);
			Структура.Вставить("НомерСтроки", 	СтрокаТЧ.НомерСтроки);
			
			Если ОдиночныйТэг Тогда			
				ТекстДляВставки = ПолучитьТекстДляВставки_Одиночный(Структура);
			Иначе
				ТекстДляВставки = ПолучитьТекстДляВставки_Двойной(Структура);
			КонецЕсли;
		Иначе //Без тегов
			ТекстДляВставки = СтрокаТЧ.Значение;
		КонецЕсли;	
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Одиночный(Структура)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Картинка) Тогда	
//		Если ЭтоКартинка(СтрокаТЧ.Картинка.Расширение) Тогда			
//			ТекстДляВставки = ПолучитьТекстДляВставки_Картинки(СтрокаТЧ);
//		Иначе
//			ТекстДляВставки = "<p><a href=""path/to/file"">" + СтрокаТЧ.Картинка.Наименование + " (файл " + СтрокаТЧ.НомерСтроки + ")</a></p>"; //- файл
//		КонецЕсли;
//	Иначе
		ТекстДляВставки = "<" + Структура.Наименование + " >" + Структура.Значение; //не картинка 
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Двойной(Структура)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Якорь) Тогда
//		ТекстДляВставки = ПолучитьТекстдляВставки_Якорь(СтрокаТЧ);	
//	Иначе
		ТекстДляВставки = ПолучитьТекстДляВставкиФормата(Структура);
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

// Получить текст для вставки формата.
// Фоматирует текс в формат html определенного вида
// Параметры:
//  Структура - Структура - Структура:
// * Одиночный - Булево - 
// * Наименование - Строка - 
// * Значение - Строка - 
// * НомерСтроки - Число - 
// 
// Возвращаемое значение:
//  Строка - Получить текст для вставки формата
&НаСервере
Функция ПолучитьТекстДляВставкиФормата(Структура)
	ТекстДляВставки = "";
	
	ТекстВставки = СтрЗаменить(Структура.Значение,Символы.ПС ,"<br>");
	ТекстДляВставки =  
		"<" + Структура.Наименование 
		+ " id=" + Структура.НомерСтроки
		+ " style = 'margin-left: 40px';>"
		+ ТекстВставки 
		+ "</" 
		+ Структура.Наименование 
		+ ">";
	
	Возврат ТекстДляВставки
	
КонецФункции

// Вставки для строки текста.
// Формирует мини страницу html для строки ТЧ
// 
// Параметры:
//  ТекстВставки - Строка - Текст вставки
// 
// Возвращаемое значение:
//  Строка - Вставки для строки текста
&НаСервере
Функция ВставкиДляСтрокиТекста(ТекстВставки)
	ТекстДляВставки = "";
	
	ТекстДляВставки = "<!DOCTYPE html>"
	+ "<html lang=""ru"">"
	+ "<head>" 
	+ "	<meta charset=""UTF-8""" + ">"
	+ "	<title> </title>"
	+ "</head>"
	+"<body>"
	+ ТекстВставки
	+ "</body>" 
	+ "</html>"
	;
	
	Возврат ТекстДляВставки
	
КонецФункции 	
#КонецОбласти
